import Typography from "@mui/material/Typography";
import { motion } from "framer-motion";
import React from "react";
import useThemeMediaQuery from "@fuse/hooks/useThemeMediaQuery";
import FusePageCarded from "@fuse/core/FusePageCarded";

function Rules() {
  const isMobile = useThemeMediaQuery((theme) => theme.breakpoints.down("lg"));

  return (
    <FusePageCarded
      content={
        <motion.div
          initial={{ opacity: 0 }}
          animate={{ opacity: 1, transition: { delay: 0.2 } }}
          className="flex flex-col items-center w-full max-w-5xl mx-auto p-24 sm:p-32"
        >
          <Typography variant="h4" className="mb-16">
            قوانین و شرایط استفاده
          </Typography>
          <Typography variant="body1">
            هرگونه استفاده از جابینجا به معنی پذیرفتن شرایط مندرج در این سایت
            است. جابینجا هیچ توافقی با کاربران خارج از این شرایط ندارد. شرایط
            زیر مربوط به کسانی است که به هر شکلی از آگهی‌های منتشر شده‌ جابینجا
            استفاده می‌کنند. موارد زیر منجر به عدم انتشار آگهی و یا تغییر آن
            خواهد شد: مغایرت با قوانین جاری جمهوری اسلامی ایران و عرف جامعه،
            ناقض حریم شخصی افراد، نقص در اطلاعات شرکت (مانند لوگو، شرح فعالیت،
            آدرس وب‌سایت، شماره تلفن و...)، هر گونه توهین به ادیان رسمی کشور،
            آداب، رسوم، قومیت‌ها، لهجه‌ها و گویش‌های مختلف، استفاده از نام یا
            لوگوی سازمان دیگری بدون اجازه کتبی از آن مجموعه (ضروری است این اجازه
            ممهور به مهر شرکتی آن سازمان باشد و برای مسئول مربوطه در جابینجا
            ارسال شود.)، هر نوع آگهی و خبرپراکنی سیاسی، اجتماعی یا مذهبی، انتشار
            آگهی در زمینه شبکه‌های هرمی و فعالیت‌های غیرقانونی و غیرمجاز اقتصادی
            مشابه، درج آدرس وب‌سایت و اطلاعات تماس (مانند شماره تلفن یا آدرس
            ایمیل) در متن آگهی، وجود جملات نادرست از نظر املایی.
          </Typography>
          <Typography variant="body1">
            انتشار متن کامل آگهی به زبان انگلیسی فقط با هماهنگی و تایید مسئولین
            پشتیبانی امکان‌پذیر است. کاربران محترم، با پذيرش کليه شرايط زیر
            امکان استفاده از سايت را خواهند داشت:
          </Typography>
          <Typography variant="body1">
            آگهی اعلام فرصت شغلی جهت اعلام یک عنوان سمت شغلی در یک شهر است و از
            زمان انتشار به مدت ۶۰ روز روی سایت خواهد ماند.
            <br />
            پس از پرداخت هزینه آگهی، مدت‌ زمان ۳ ماهه برای انتشار آگهی در نظر
            گرفته شده است. (این زمان با توجه به بسته انتخابی متغیر است.)
            <br />
            در صورت رد شدن آگهی، مدت‌ زمان ۳ ماهه برای ویرایش و انتشار مجدد آگهی
            در نظر گرفته شده است. (این زمان با توجه به بسته انتخابی متغیر است.)
            <br />
            پس از ثبت و انتشار آگهی، هزینه آن مسترد نخواهد شد، مگر تحت شرایطی که
            وبسایت تعهدی بابت آن داده باشد.
            <br />
            بازگشت وجه بسته‌های خریداری شده به علت ثبت در سامانه مودیان تنها تا
            سه ماه بعد از خرید امکان‌پذیر خواهد بود.
            <br />
            مدیریت وبسایت حق به‌روزرسانی سایت و خدمات آن را بدون هیچ محدودیتی در
            هر زمان و بدون اطلاع کاربران خواهد داشت. هرگونه تغییر و یا حذفی پس
            از زمان انتشار نسخه به روز شده به کاربران اطلاع‌رسانی خواهد شد.
            <br />
            تلاش جابینجا، نشر آگهی‌ها با اطلاعات صحیح و درست است، اما نمی‌تواند
            صحت آگهی‌ها را تضمین نماید و هیچ‌گونه تعهد یا مسئولیتی در قبال
            آگهی‌ها برعهده نمی‌پذیرد.
            <br />
            مسئولیت استفاده از آگهی‌های این سایت بر عهده کاربران است و جابینجا
            هیچ تعهدى در قبال خسارات مستقیم، اتفاقى، تبعى، غیرمستقیم و کیفرى،
            ناشى از دسترسى و استفاده از این سایت ندارد.
            <br />
            کاربرانِ جابینجا در هر لحظه قادر به ویرایش آگهی و یا پروفایل خود
            هستند، بنابراین جابینجا، هیچ‌گونه مسئولیتی را در قبال هر نوع آگهی و
            یا رزومه درج شده در سایت نمی‌پذیرد و صرفاً مطالب درج شده توسط
            کاربران را نمایش می‌دهد.
            <br />
            مسئولیت استفاده از هرگونه متن، پیام، توضیح، اطلاعات، عکس، مشخصات
            تماس و موارد مشابه که به جابینجا ارسال می‌شود یا در آن قرار می‌گیرد،
            شامل بازتولید، افشاء، مخابره، نشر و پخش آن بر عهده فرستنده اطلاعات
            است.
            <br />
            جابینجا مختار است هر گونه پیام، آگهی یا تصویری که به این سایت ارسال
            شده یا حساب کاربری و اطلاعات دیگری که مربوط به شما یا توسط کاربران
            ایجاد شده باشد را هر زمانی و به هر شکلی که ضروری بداند ویرایش کند.
            <br />
            جابینجا مختار است هر گونه پیام، آگهی یا تصویری که به این سایت ارسال
            شده یا هر حساب کاربری و اطلاعات دیگری که مربوط به شما یا توسط
            کاربران ایجاد شده باشد را هر زمانی و به هر شکلی که ضروری بداند حذف
            کند. حق حذف آگهی‌ها در هر زمان به ارسال‌کننده آگهی داده شده است.
            <br /> استفاده از محتويات سايت (به شكل اوليه و بدون تغيير در ساختار
            محتوایی و ظاهری) با ذکر منبع و اهداف غيرانتفاعی و صرفا جهت اطلاع
            رسانی بلامانع است.
          </Typography>
        </motion.div>
      }
      scroll={isMobile ? "normal" : "page"}
    />
  );
}

export default Rules;
